app/controllers/post_controller.rb

SELECT * FROM "posts" ORDER BY id desc
---
  def list
    # filters
    cond = {}
    cond[:category_id] = Category.find_by_name(params[:category]).id  if params[:category]
    cond[:user_id]     = User.    find_by_name(params[:user]).id      if params[:user]
    # by default, do not display the removed
    cond[:state] = ['published', 'draft']
    cond[:state] = params[:state] if params[:state]

    page = params[:page] || 1
    @posts = Post.paginate(:all,
                           :page=>page,
                           :conditions=>cond,
                           :order=>'id desc',
                           :per_page=>20)

INSERT INTO "posts" ("created_at", "title", "updated_at", "user_id", "content") VALUES('2010-04-12 08:40:18', '', '2010-04-12 08:40:18', NULL, '')
INSERT INTO "users" ("name", "created_at", "updated_at", "pass") VALUES('root', '2010-04-12 08:39:52', '2010-04-12 08:39:52', '123456')
UPDATE "posts" SET "updated_at" = '2010-04-13 07:27:55', "user_id" = 2 WHERE "id" = 20
---
  def add
    @post = Post.new(params[:post])
    if request.post?
      # blah~
      @post.user = current_user
      @post.category = Category.find_by_name(params[:category])
      if @post.save

SELECT * FROM "posts" WHERE ("posts"."id" = 1)
UPDATE "posts" SET "updated_at" = '2010-04-12 09:24:24', "title" = '人物特殊', "content" = '特殊她' WHERE "id" = 9
---
  def edit
    @post = Post.find(params[:id])
    if request.post?
      @post.category = Category.find_by_name(params[:category])
      if @post.update_attributes(params[:post])

SELECT * FROM "posts" WHERE ("posts"."id" = 1)
---
  def rm
    @post = Post.find(params[:id])