app/controllers/post_controller.rb

DELETE FROM "posts" WHERE "id" = 1
---
  def rm
    @post = Post.find(params[:id])
    @post.destroy